In [39]:
import pandas as pd
import numpy as np

In [40]:
# Larger employee dataset
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack', 'Kara', 'Liam'],
'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
'Salary': [50000, 60000, 70000, 52000, 58000, 72000, 55000, 62000, 75000, 51000, 63000, 76000],
'Experience': [2, 5, 8, 3, 4, 10, 4, 6, 12, 1, 7, 15]
}
df = pd.DataFrame(data)
df

       Name Department  Salary  Experience
0     Alice         HR   50000           2
1       Bob    Finance   60000           5
2   Charlie         IT   70000           8
3     David         HR   52000           3
4       Eva    Finance   58000           4
5     Frank         IT   72000          10
6     Grace         HR   55000           4
7    Hannah    Finance   62000           6
8       Ian         IT   75000          12
9      Jack         HR   51000           1
10     Kara    Finance   63000           7
11     Liam         IT   76000          15

1 -> la media dello stipendio e dell'esperienza per ogni dipartimento

In [41]:
grup_dep = df.groupby('Department')
avg_stipedio = grup_dep['Salary'].mean()
avg_exp = grup_dep['Experience'].mean()

avg_stipedio,avg_exp

(Department
 Finance    60750.0
 HR         52000.0
 IT         73250.0
 Name: Salary, dtype: float64,
 Department
 Finance     5.50
 HR          2.50
 IT         11.25
 Name: Experience, dtype: float64)

2 -> trovare i dipendenti con uno stipendio sopra la media del loro dipartimento

In [ ]:
df['Media'] = df.groupby('Department')['Salary'].transform('mean')

df_ricchi = df[df['Salary'] > df['Media']]
df_ricchi

      Name Department  Salary  Experience    Media
6    Grace         HR   55000           4  52000.0
7   Hannah    Finance   62000           6  60750.0
8      Ian         IT   75000          12  73250.0
10    Kara    Finance   63000           7  60750.0
11    Liam         IT   76000          15  73250.0

aggiungere una nuova colonna che rappresenta il rank (consiglio cercate la funzione rank di pandas) di ogni dipendente all'interno del suo dipartimento

In [ ]:
df['Rank'] = df['Salary'].rank()
df

Mostrare il fataframe raggruppato per dipartimento e ogni dipendente in ordine dal rank più alto al più basso (rank in base allo stipendio)